  This PR will be making the following changes to the resources:
  <details>
    <summary>Terraform plan</summary>
    ```
    
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_image.app will be created
  + resource "docker_image" "app" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/online-classifier-app/app"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "f8a591c55d4d2e102d673209f49048fedd48a78e"
        }

      + build {
          + build_args   = {
              + "HOST_URL" = "https://service-deployment-kttol2mhha-nw.a.run.app/"
            }
          + cache_from   = []
          + context      = "/workspace/terraform/.."
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }

  # docker_registry_image.app will be created
  + resource "docker_registry_image" "app" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = false
      + name                 = "eu.gcr.io/online-classifier-app/app"
      + sha256_digest        = (known after apply)
      + triggers             = (known after apply)
    }

  # google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west2"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "service-deployment"
    }

  # google_cloud_run_v2_service.default will be created
  + resource "google_cloud_run_v2_service" "default" {
      + conditions              = (known after apply)
      + etag                    = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west2"
      + name                    = "service-deployment"
      + observed_generation     = (known after apply)
      + project                 = (known after apply)
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = 4
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = (known after apply)

              + resources {
                  + limits = {
                      + "cpu"    = "2"
                      + "memory" = "1Gi"
                    }
                }
            }

          + scaling {
              + max_instance_count = 1
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_container_registry.registry will be created
  + resource "google_container_registry" "registry" {
      + bucket_self_link = (known after apply)
      + id               = (known after apply)
      + location         = "EU"
      + project          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
    ```
  </details>      EOF
else
  cat <<EOF > /workspace/message.txt
  Failed to run Acquiring state lock. This may take a few moments...
[0m[1mvar.backend_host_url[0m
  [1mEnter a value:[0m [0m[0m[1mvar.docker_image_version[0m
  [1mEnter a value:[0m [0m[0m[1mvar.gcp_project_id[0m
  [1mEnter a value:[0m [0m[0m[1mvar.gcr_host[0m
  [1mEnter a value:[0m [0m[0m[1mvar.gcr_location[0m
  [1mEnter a value:[0m [0m[0m[1mvar.resources_region[0m
  [1mEnter a value:[0m [0m:
  <details>
    <summary>Terraform error</summary>
    ```
    Acquiring state lock. This may take a few moments...
[0m[1mdata.google_client_config.default: Reading...[0m[0m
[0m[1mdata.google_iam_policy.noauth: Reading...[0m[0m
[0m[1mdata.google_iam_policy.noauth: Read complete after 0s [id=3450855414][0m
[0m[1mdata.google_client_config.default: Read complete after 0s [id=projects/"online-classifier-app"/regions/"europe-west2"/zones/<null>][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # docker_image.app[0m will be created
[0m  [32m+[0m[0m resource "docker_image" "app" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m image_id    = (known after apply)
      [32m+[0m[0m name        = "eu.gcr.io/online-classifier-app/app"
      [32m+[0m[0m repo_digest = (known after apply)
      [32m+[0m[0m triggers    = {
          [32m+[0m[0m "dir_sha1" = "f8a591c55d4d2e102d673209f49048fedd48a78e"
        }

      [32m+[0m[0m build {
          [32m+[0m[0m build_args   = {
              [32m+[0m[0m "HOST_URL" = "https://service-deployment-kttol2mhha-nw.a.run.app/"
            }
          [32m+[0m[0m cache_from   = []
          [32m+[0m[0m context      = "/workspace/terraform/.."
          [32m+[0m[0m dockerfile   = "Dockerfile"
          [32m+[0m[0m extra_hosts  = []
          [32m+[0m[0m remove       = true
          [32m+[0m[0m security_opt = []
          [32m+[0m[0m tag          = []
        }
    }

[1m  # docker_registry_image.app[0m will be created
[0m  [32m+[0m[0m resource "docker_registry_image" "app" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m insecure_skip_verify = false
      [32m+[0m[0m keep_remotely        = false
      [32m+[0m[0m name                 = "eu.gcr.io/online-classifier-app/app"
      [32m+[0m[0m sha256_digest        = (known after apply)
      [32m+[0m[0m triggers             = (known after apply)
    }

[1m  # google_cloud_run_service_iam_policy.noauth[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_service_iam_policy" "noauth" {
      [32m+[0m[0m etag        = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m location    = "europe-west2"
      [32m+[0m[0m policy_data = jsonencode(
            {
              [32m+[0m[0m bindings = [
                  [32m+[0m[0m {
                      [32m+[0m[0m members = [
                          [32m+[0m[0m "allUsers",
                        ]
                      [32m+[0m[0m role    = "roles/run.invoker"
                    },
                ]
            }
        )
      [32m+[0m[0m project     = (known after apply)
      [32m+[0m[0m service     = "service-deployment"
    }

[1m  # google_cloud_run_v2_service.default[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service" "default" {
      [32m+[0m[0m conditions              = (known after apply)
      [32m+[0m[0m etag                    = (known after apply)
      [32m+[0m[0m generation              = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ingress                 = "INGRESS_TRAFFIC_ALL"
      [32m+[0m[0m latest_created_revision = (known after apply)
      [32m+[0m[0m latest_ready_revision   = (known after apply)
      [32m+[0m[0m launch_stage            = (known after apply)
      [32m+[0m[0m location                = "europe-west2"
      [32m+[0m[0m name                    = "service-deployment"
      [32m+[0m[0m observed_generation     = (known after apply)
      [32m+[0m[0m project                 = (known after apply)
      [32m+[0m[0m reconciling             = (known after apply)
      [32m+[0m[0m terminal_condition      = (known after apply)
      [32m+[0m[0m traffic_statuses        = (known after apply)
      [32m+[0m[0m uid                     = (known after apply)
      [32m+[0m[0m uri                     = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m max_instance_request_concurrency = 4
          [32m+[0m[0m service_account                  = (known after apply)
          [32m+[0m[0m timeout                          = (known after apply)

          [32m+[0m[0m containers {
              [32m+[0m[0m image = (known after apply)

              [32m+[0m[0m resources {
                  [32m+[0m[0m limits = {
                      [32m+[0m[0m "cpu"    = "2"
                      [32m+[0m[0m "memory" = "1Gi"
                    }
                }
            }

          [32m+[0m[0m scaling {
              [32m+[0m[0m max_instance_count = 1
            }
        }

      [32m+[0m[0m traffic {
          [32m+[0m[0m percent = 100
          [32m+[0m[0m type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

[1m  # google_container_registry.registry[0m will be created
[0m  [32m+[0m[0m resource "google_container_registry" "registry" {
      [32m+[0m[0m bucket_self_link = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m location         = "EU"
      [32m+[0m[0m project          = (known after apply)
    }

[1mPlan:[0m 5 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"
    ```
  </details>
